snlkuharlocal/src/Documents/СверкаДанных/СверкаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СверкаДанных</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеИст</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФормирования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДанныеИст</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьДанныеТек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПланаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМетаданных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>ТипОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеЦБ</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДанныеПБ</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/ОстаткиТМЦ/ОстаткиТМЦ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиТМЦ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>CatalogRef.СтатьиЗатрат</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДК</name>
    <type>
      <types>CatalogRef.ДисконтныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОборотУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОборотБезСкидкиУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Акция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>String</types>
      <types>CatalogRef.Контрагенты</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субзатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  </aggregates>
  <resources>
    <name>КолРасх</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КолПрих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СумРасх</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СумПрих</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Оборот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОборотБезСкидки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Профит</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПродажиБезВозврата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Покупатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЧерезКассу</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Documents/СверкаДанных/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли; 
	
	ЗаполнитьШапкуДокумента(ЭтотОбъект,"Продажа");	
	ИмяПланаОбмена	= "ФР_ОбменСФРК";
	КодУзлаСоздания	= ФР_ОбщегоНазначения_ПИ.ЭтотУзелКод(ИмяПланаОбмена);
КонецПроцедуры

Функция ЗаполнитьДанныеСверки(Адрес=Неопределено) Экспорт
	Данные.Очистить();
	
	Части 		= СтрРазделить(ТипОбъекта,".");
	ВидОбъекта	= Части[1];
	ДанныеСверки= Неопределено;
	
	Если ЭтотОбъект.ТипМетаданных = "РегистрыНакопления" Тогда		
		МетаОбъект		= Метаданные.РегистрыНакопления.Найти(ВидОбъекта);
		Если ТипДанных="Остатки" Тогда
			Если МетаОбъект.ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
				ДанныеСверки	= Вычислить(СтрШаблон("ПолучитьДанныеДляСверки_%1_%2(Дата1,Дата2)",ВидОбъекта,ТипДанных));
			КонецЕсли;	
		КонецЕсли;		
	ИначеЕсли ЭтотОбъект.ТипМетаданных = "Документы" Тогда		
		ДанныеСверки	= Документы.СверкаДанных.ПолучитьДанныеДляСверкиДокументов(ВидОбъекта, Дата1, КонецДня(Дата2), Подразделение);		
	КонецЕсли;	
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеСверки,Адрес);	
КонецФункции 

Функция ПолучитьДанныеДляСверки_ОстаткиТМЦ_Остатки(Дата1,Дата2) Экспорт
	
	Запрос	= Новый Запрос;
	
	Запрос.УстановитьПараметр("Дата1",			НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",			КонецДня(Дата2));
	
	Запрос.УстановитьПараметр("Подразделение",	Подразделение);
	
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	Склад,	
	|	Номенклатура.Родитель 				КАК Номенклатура,
	|	Номенклатура		 				КАК ХарактеристикаНоменклатуры,
	|
	|	СУММА(КоличествоНачальныйОстаток)	КАК КоличествоНачальныйОстаток,
	|	СУММА(КоличествоОборот)				КАК КоличествоОборот,
	|	СУММА(КоличествоКонечныйОстаток)	КАК КоличествоКонечныйОстаток	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1,&Дата2,,,Склад.Подразделение=&Подразделение)
	|СГРУППИРОВАТЬ ПО 
	|	Склад,	
	|	Номенклатура
	|";
	
	СсылочныеКолонки	= "Склад,Номенклатура,ХарактеристикаНоменклатуры"; 
	
	Результат	= Запрос.Выполнить();
	
	тОстатки	= Новый ТаблицаЗначений;
	Для Каждого Колонка Из Результат.Колонки Цикл
		Если НЕ СтрНайти(СсылочныеКолонки,Колонка.Имя)>0 Тогда		
			тОстатки.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения);				
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого Имя Из СтрРазделить(СсылочныеКолонки,",") Цикл	
		тОстатки.Колонки.Добавить(Имя);	
	КонецЦикла;	
		
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		СтрокаД	= тОстатки.Добавить();			
		ЗаполнитьЗначенияСвойств(СтрокаД,Выборка);		
		
		СтрокаД.Склад						= Новый Структура("Вид,Ссылка","Справочник.Склады",						Выборка.Склад.УникальныйИдентификатор());
		СтрокаД.Номенклатура				= Новый Структура("Вид,Ссылка","Справочник.Номенклатура",				Выборка.Номенклатура.УникальныйИдентификатор());
		СтрокаД.ХарактеристикаНоменклатуры	= Новый Структура("Вид,Ссылка","Справочник.ХарактеристикиНоменклатуры",	Выборка.ХарактеристикаНоменклатуры.УникальныйИдентификатор());
	КонецЦикла;	
	
	Возврат тОстатки;
КонецФункции //ПолучитьДанныеДляСверки(Дата1,Дата2)

Функция ПолучитьДанныеДляСверки_ОстаткиТМЦ_Обороты(Дата1,Дата2,Подразделение) Экспорт
	Запрос	= Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	Склад,	
	|	Регистратор,		
	|	ТипЗначения(Регистратор) КАК ВидРегистратора,
	|	Регистратор.Номер	КАК Номер,
	|	Регистратор.Дата	КАК Дата,
	|	КоличествоОборот	КАК КоличествоОборот,
	|	СуммаОборот			КАК Стоимость_НацОборот
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.Обороты(&Дата1,&Дата2, Авто, Склад.Подразделение=&Подразделение) КАК ОстаткиТМЦОбороты
	|";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	Результат	= Запрос.Выполнить();
	
	тОбороты	= Новый ТаблицаЗначений;
	Для Каждого Колонка Из Результат.Колонки Цикл
		Если НЕ СтрНайти("Регистратор,Склад,ВидРегистратора",Колонка.Имя)>0 Тогда		
			тОбороты.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения);				
		КонецЕсли;		
	КонецЦикла;
	
	тОбороты.Колонки.Добавить("Регистратор");
	тОбороты.Колонки.Добавить("Склад");	
	
	КэшВидов	= Новый Соответствие;	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		ВидРегистратора	= КэшВидов.Получить(Выборка.ВидРегистратора);
		Если ВидРегистратора=Неопределено Тогда
			ВидРегистратора	= Метаданные.НайтиПоТипу(Выборка.ВидРегистратора).ПолноеИмя();
			КэшВидов.Вставить(Выборка.ВидРегистратора,ВидРегистратора);
		КонецЕсли; 
		СтрокаД	= тОбороты.Добавить();			
		ЗаполнитьЗначенияСвойств(СтрокаД,Выборка);		
		
		СтрокаД.Регистратор = Новый Структура("Вид,Ссылка,Номер,Дата",			ВидРегистратора,		Выборка.Регистратор.УникальныйИдентификатор(),Выборка.Номер,Выборка.Дата);
		СтрокаД.Склад		= Новый Структура("Вид,Ссылка",						"Справочник.Склады",	Выборка.Склад.УникальныйИдентификатор());
	КонецЦикла;	
	
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	Склад,	
	|	Номенклатура.Родитель КАК Номенклатура,
	|	СУММА(КоличествоНачальныйОстаток)	КАК КоличествоНачальныйОстаток,
	|	СУММА(КоличествоОборот)				КАК КоличествоОборот,
	|	СУММА(КоличествоКонечныйОстаток)	КАК КоличествоКонечныйОстаток	
	|ИЗ
	|	РегистрНакопления.ОстаткиТМЦ.ОстаткиИОбороты(&Дата1,&Дата2,,,Склад.Подразделение=&Подразделение)
	|СГРУППИРОВАТЬ ПО 
	|	Склад,	
	|	Номенклатура.Родитель
	|";
	
	Результат	= Запрос.Выполнить();
	
	тОстатки	= Новый ТаблицаЗначений;
	Для Каждого Колонка Из Результат.Колонки Цикл
		Если НЕ СтрНайти("Склад,Номенклатура",Колонка.Имя)>0 Тогда		
			тОстатки.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения);				
		КонецЕсли;		
	КонецЦикла;
	
	тОстатки.Колонки.Добавить("Склад");
	тОстатки.Колонки.Добавить("Номенклатура");
	
	КэшВидов	= Новый Соответствие;
		
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		СтрокаД	= тОстатки.Добавить();			
		ЗаполнитьЗначенияСвойств(СтрокаД,Выборка);		
		
		СтрокаД.Склад			= Новый Структура("Вид,Ссылка","Справочник.Склады",			Выборка.Склад.УникальныйИдентификатор());
		СтрокаД.Номенклатура	= Новый Структура("Вид,Ссылка","Справочник.Номенклатура",	Выборка.Номенклатура.УникальныйИдентификатор());
	КонецЦикла;
	
	Результат	= Новый Структура("Остатки,Обороты",тОстатки,тОбороты);
	
	Возврат Результат;
КонецФункции //ПолучитьДанныеДляСверки(Дата1,Дата2)

Функция ПолучитьДанныеДляСверки_ДенежныеСредства(Дата1,Дата2,Подразделение) Экспорт
	СтрокаИзмерений	= "БанковскийСчет,Валюта";
	Измерения		= СтрРазделить(СтрокаИзмерений,",");	
	
	Запрос	= Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	"+СтрокаИзмерений+",
	|	Регистратор,		
	|	ТипЗначения(Регистратор) КАК ВидРегистратора,
	|	Регистратор.Номер	КАК Номер,
	|	Регистратор.Дата	КАК Дата,
	|	СуммаВалОборот,
	|	СуммаУпрОборот
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Обороты(&Дата1,&Дата2, Авто,
	|		ВЫБОР 
	|			КОГДА БанковскийСчет ССЫЛКА Справочник.БанковскиеСчета	ТОГДА БанковскийСчет.Подразделение
	|			КОГДА БанковскийСчет ССЫЛКА Справочник.Кассы 			ТОГДА БанковскийСчет.Владелец
	|		ИНАЧЕ
	|			NULL 
	|		КОНЕЦ	= &Подразделение
	|	)
	|";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	Результат	= Запрос.Выполнить();
	
	тОбороты	= Новый ТаблицаЗначений;
	Для Каждого Колонка Из Результат.Колонки Цикл
		Если НЕ СтрНайти("Регистратор,ВидРегистратора,"+СтрокаИзмерений,Колонка.Имя)>0 Тогда		
			тОбороты.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения);				
		КонецЕсли;		
	КонецЦикла;
	
	тОбороты.Колонки.Добавить("Регистратор");
	Для Каждого Измерение Из Измерения Цикл
		тОбороты.Колонки.Добавить(Измерение);	
	КонецЦикла;
	
	КэшВидов	= Новый Соответствие;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		ВидРегистратора	= КэшВидов.Получить(Выборка.ВидРегистратора);
		Если ВидРегистратора	= Неопределено Тогда
			ВидРегистратора	= Метаданные.НайтиПоТипу(Выборка.ВидРегистратора).ПолноеИмя();
			КэшВидов.Вставить(Выборка.ВидРегистратора,ВидРегистратора);
		КонецЕсли; 
		СтрокаД	= тОбороты.Добавить();			
		ЗаполнитьЗначенияСвойств(СтрокаД,Выборка);		
		
		Для Каждого Измерение Из Измерения Цикл
			ЗначениеИзменения	= Выборка[Измерение];
			ОТ	= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ЗначениеВСтрокуВнутр(ТипЗнч(ЗначениеИзменения)));
			СтрокаД[Измерение]	= Новый Структура("Вид,Ссылка",ОТ.ПолноеИмя,ЗначениеИзменения.УникальныйИдентификатор());
		КонецЦикла;		
		
		СтрокаД.Регистратор = Новый Структура("Вид,Ссылка,Номер,Дата",ВидРегистратора,Выборка.Регистратор.УникальныйИдентификатор(),Выборка.Номер,Выборка.Дата);
	КонецЦикла;	
	
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	"+СтрокаИзмерений+",	
	|
	|	СуммаВалНачальныйОстаток,
	|	СуммаВалОборот,
	|	СуммаВалКонечныйОстаток,
	|
	|	СуммаУпрНачальныйОстаток,
	|	СуммаУпрОборот,
	|	СуммаУпрКонечныйОстаток
	|
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.ОстаткиИОбороты(&Дата1,&Дата2,,,
	|		ВЫБОР 
	|			КОГДА БанковскийСчет ССЫЛКА Справочник.БанковскиеСчета	ТОГДА БанковскийСчет.Подразделение
	|			КОГДА БанковскийСчет ССЫЛКА Справочник.Кассы 			ТОГДА БанковскийСчет.Владелец
	|		ИНАЧЕ
	|			NULL 
	|		КОНЕЦ	= &Подразделение
	|	)
	|";
	
	Результат	= Запрос.Выполнить();
	
	тОстатки	= Новый ТаблицаЗначений;
	Для Каждого Колонка Из Результат.Колонки Цикл
		Если НЕ СтрНайти(СтрокаИзмерений,Колонка.Имя)>0 Тогда		
			тОстатки.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения);				
		КонецЕсли;		
	КонецЦикла;
	
	Для Каждого Измерение Из Измерения Цикл
		тОстатки.Колонки.Добавить(Измерение);		
	КонецЦикла;	
	
	КэшВидов	= Новый Соответствие;
		
	Выборка		= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		СтрокаД	= тОстатки.Добавить();			
		ЗаполнитьЗначенияСвойств(СтрокаД,Выборка);		
		
		Для Каждого Измерение Из Измерения Цикл
			ЗначениеИзменения	= Выборка[Измерение];
			ОТ	= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ЗначениеВСтрокуВнутр(ТипЗнч(ЗначениеИзменения)));
			СтрокаД[Измерение]	= Новый Структура("Вид,Ссылка",ОТ.ПолноеИмя,ЗначениеИзменения.УникальныйИдентификатор());
		КонецЦикла;		
	КонецЦикла;
	
	Результат	= Новый Структура("Остатки,Обороты",тОстатки,тОбороты);
	
	Возврат Результат;
КонецФункции

Функция ПолучитьДанныеДляСверки_Продажи(Дата1,Дата2,Подразделение) Экспорт
	СтрокаИзмерений	= "Модель,ПериодДень";
	Измерения		= СтрРазделить(СтрокаИзмерений,",");	
	
	Запрос			= Новый Запрос;
	Запрос.Текст	= "
	|ВЫБРАТЬ
	|	Номенклатура.Родитель		КАК Модель,
	|	Регистратор,		
	|	ТипЗначения(Регистратор)	КАК ВидРегистратора,
	|	ПериодДень					КАК ПериодДень,
	|	Регистратор.Номер			КАК Номер,
	|	Регистратор.Дата			КАК Дата,
	|
	|   КолРасхОборот - КолПрихОборот КАК КоличествоОборот,
	|	
	|	ОборотОборот				КАК Оборот_НацОборот
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&Дата1,&Дата2, Авто, Подразделение = &Подразделение)
	|	
	|";
	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	Запрос.УстановитьПараметр("Подразделение",Подразделение);
	
	Результат	= Запрос.Выполнить();
	
	тОбороты	= Новый ТаблицаЗначений;
	Для Каждого Колонка Из Результат.Колонки Цикл
		Если НЕ СтрНайти("Регистратор,ВидРегистратора,"+СтрокаИзмерений,Колонка.Имя)>0 Тогда		
			тОбороты.Колонки.Добавить(Колонка.Имя,Колонка.ТипЗначения);				
		КонецЕсли;		
	КонецЦикла;
	
	тОбороты.Колонки.Добавить("Регистратор");
	Для Каждого Измерение Из Измерения Цикл
		тОбороты.Колонки.Добавить(Измерение);
	КонецЦикла;	
	
	КэшВидов	= Новый Соответствие;
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		ВидРегистратора	= КэшВидов.Получить(Выборка.ВидРегистратора);
		Если ВидРегистратора	= Неопределено Тогда
			ВидРегистратора	= Метаданные.НайтиПоТипу(Выборка.ВидРегистратора).ПолноеИмя();
			КэшВидов.Вставить(Выборка.ВидРегистратора,ВидРегистратора);
		КонецЕсли; 
		СтрокаД	= тОбороты.Добавить();			
		ЗаполнитьЗначенияСвойств(СтрокаД,Выборка);		
		
		Для Каждого Измерение Из Измерения Цикл
			ЗначениеИзменения	= Выборка[Измерение];
			ОТ	= ФР_ОбщегоНазначения_ПИ.ОписаниеТипа(ЗначениеВСтрокуВнутр(ТипЗнч(ЗначениеИзменения)));
			Если ОТ.Тип="Справочник" ИЛИ ОТ.Тип="Документ" Тогда
				СтрокаД[Измерение]	= Новый Структура("Вид,Ссылка",ОТ.ПолноеИмя,ЗначениеИзменения.УникальныйИдентификатор());
			КонецЕсли;
		КонецЦикла;		
		
		СтрокаД.Регистратор = Новый Структура("Вид,Ссылка,Номер,Дата",ВидРегистратора,Выборка.Регистратор.УникальныйИдентификатор(),Выборка.Номер,Выборка.Дата);
	КонецЦикла;
		
	Результат	= Новый Структура("Обороты",тОбороты);
	
	Возврат Результат;
КонецФункции

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс	= ФР_ОбщегоНазначения_ПИ.ЭтотУзелКод()+"-";
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Данные.Очистить();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИмяПланаОбмена	= "ФР_ОбменСФРК";
	Автор			= ПараметрыСеанса.Пользователь;
	КодУзлаСоздания	= ФР_ОбщегоНазначения_ПИ.ЭтотУзелКод(ИмяПланаОбмена);
	ЕстьДанныеТек	= Неопределено;
	ДанныеТек		= Неопределено;
КонецПроцедуры
